### 📖 Terraform Plan (infra/resources/psn/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.storage_accounts.azurerm_key_vault_secret.st_connection_string[0] has been deleted
  - resource "azurerm_key_vault_secret" "st_connection_string" {
        id                      = "https://iw-p-itn-apps-kv-01.vault.azure.net/secrets/StorageConnectionString/76d6deb1c7e94f6dad6943f302adc901"
      - name                    = "StorageConnectionString" -> null
        tags                    = {}
      - value_wo                = (write-only attribute) -> null
        # (10 unchanged attributes hidden)
    }

  # module.storage_accounts.azurerm_key_vault_secret.st_uat_connection_string[0] has been deleted
  - resource "azurerm_key_vault_secret" "st_uat_connection_string" {
        id                      = "https://iw-p-itn-apps-kv-01.vault.azure.net/secrets/StorageUatConnectionString/9e158683d71240d79d713d4305dd3c67"
      - name                    = "StorageUatConnectionString" -> null
        tags                    = {}
      - value_wo                = (write-only attribute) -> null
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_api_management_api.user_ioweb_v1 will be updated in-place
  ~ resource "azurerm_api_management_api" "user_ioweb_v1" {
      + description           = "REST APIs consumed by IO Web"
        id                    = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01/apis/user-ioweb-api-v1;rev=1"
        name                  = "user-ioweb-api-v1"
        # (16 unchanged attributes hidden)

      ~ import {
          ~ content_value  = jsonencode(
              ~ {
                  ~ components = {
                      ~ schemas         = {
                          + FiscalCode                  = {
                              + description = "User's fiscal code."
                              + example     = "SPNDNL80R13C555X"
                              + format      = "FiscalCode"
                              + type        = "string"
                              + x-import    = "@pagopa/ts-commons/lib/strings"
                            }
                          ~ SetWalletInstanceStatusData = {
                              - enum       = [
                                  - "REVOKED",
                                ]
                              + properties = {
                                  + fiscal_code = {
                                      + "$ref" = "#/components/schemas/FiscalCode"
                                    }
                                  + status      = {
                                      + enum = [
                                          + "REVOKED",
                                        ]
                                      + type = "string"
                                    }
                                }
                              + required   = [
                                  + "status",
                                  + "fiscal_code",
                                ]
                              ~ type       = "string" -> "object"
                            }
                            # (3 unchanged attributes hidden)
                        }
                      - securitySchemes = {
                          - BearerAuth = {
                              - bearerFormat = "JWT"
                              - scheme       = "bearer"
                              - type         = "http"
                            }
                        }
                        # (1 unchanged attribute hidden)
                    }
                  ~ info       = {
                      ~ title   = "IO Wallet - IO Web API" -> "IT-Wallet User - IO Web v1"
                      ~ version = "1.0.0" -> "v1"
                    }
                  ~ paths      = {
                      ~ "/wallet-instances/current/status" = {
                          ~ get = {
                              + parameters  = [
                                  + {
                                      + in       = "header"
                                      + name     = "fiscal-code"
                                      + required = true
                                      + schema   = {
                                          + "$ref" = "#/components/schemas/FiscalCode"
                                        }
                                    },
                                ]
                                # (3 unchanged attributes hidden)
                            }
                        }
                        # (2 unchanged attributes hidden)
                    }
                  - security   = [
                      - {
                          - BearerAuth = []
                        },
                    ]
                  + servers    = [
                      + {
                          + url = "https://apim.internal.wallet.io.pagopa.it/api/wallet/ioweb/v1"
                        },
                    ]
                    # (1 unchanged attribute hidden)
                }
            )
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_api_management_api_policy.user_ioweb_v1 will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "user_ioweb_v1" {
        id                  = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01/apis/user-ioweb-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-header name="x-functions-key" exists-action="override">
          - 			<value>{{UserIOWebFunctionKey}}</value>
          - 		</set-header>
          - 		<set-backend-service backend-id="function-user-01" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +       <base />
          +       <set-header name="x-functions-key" exists-action="override">
          +         <value>{{UserIOWebFunctionKey}}</value>
          +       </set-header>
          +       <set-backend-service backend-id="function-user-01" />
          +   </inbound>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # azurerm_api_management_api_policy.user_uat_ioapp_v1 will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "user_uat_ioapp_v1" {
        id                  = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01/apis/user-uat-ioapp-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="function-user-uat-01" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +       <base />
          +       <set-backend-service backend-id="function-user-uat-01" />
          +   </inbound>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # azurerm_api_management_backend.func_support will be updated in-place
  ~ resource "azurerm_api_management_backend" "func_support" {
        id                  = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01/backends/function-support-01"
        name                = "function-support-01"
        # (7 unchanged attributes hidden)

      - tls {
          - validate_certificate_chain = false -> null
          - validate_certificate_name  = false -> null
        }

        # (1 unchanged block hidden)
    }

  # azurerm_api_management_backend.func_user will be updated in-place
  ~ resource "azurerm_api_management_backend" "func_user" {
        id                  = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01/backends/function-user-01"
        name                = "function-user-01"
        # (7 unchanged attributes hidden)

      - credentials {
          - certificate = [] -> null
          - header      = {} -> null
          - query       = {} -> null
        }

      - tls {
          - validate_certificate_chain = false -> null
          - validate_certificate_name  = false -> null
        }
    }

  # azurerm_api_management_named_value.func_user_ioapp_key will be updated in-place
  ~ resource "azurerm_api_management_named_value" "func_user_ioapp_key" {
        id                  = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01/namedValues/user-func-ioapp-key"
        name                = "user-func-ioapp-key"
        tags                = []
      + value               = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # azurerm_api_management_named_value.func_user_ioweb_key will be updated in-place
  ~ resource "azurerm_api_management_named_value" "func_user_ioweb_key" {
        id                  = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01/namedValues/user-func-ioweb-key"
        name                = "user-func-ioweb-key"
        tags                = []
      + value               = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # azurerm_api_management_tag.user_ioweb will be created
  + resource "azurerm_api_management_tag" "user_ioweb" {
      + api_management_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.ApiManagement/service/iw-p-itn-apps-apim-01"
      + display_name      = (known after apply)
      + id                = (known after apply)
      + name              = "user-ioweb"
    }

  # azurerm_private_dns_a_record.api_internal_wallet_io_pagopa_it will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "api_internal_wallet_io_pagopa_it" {
        id                  = "/subscriptions/f3c27dbc-5c86-4c14-b43f-9faed77e5e19/resourceGroups/pagopa-rg-hub-network-italynorth/providers/Microsoft.Network/privateDnsZones/internal.wallet.io.pagopa.it/A/api"
        name                = "api"
        tags                = {}
      ~ ttl                 = 10 -> 3600
        # (4 unchanged attributes hidden)
    }

  # azurerm_private_dns_a_record.apim_internal_wallet_io_pagopa_it will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_internal_wallet_io_pagopa_it" {
        id                  = "/subscriptions/f3c27dbc-5c86-4c14-b43f-9faed77e5e19/resourceGroups/pagopa-rg-hub-network-italynorth/providers/Microsoft.Network/privateDnsZones/internal.wallet.io.pagopa.it/A/apim"
        name                = "apim"
        tags                = {}
      ~ ttl                 = 30 -> 3600
        # (4 unchanged attributes hidden)
    }

  # module.apim.azurerm_monitor_autoscale_setting.this[0] will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/autoScaleSettings/iw-p-itn-apps-apim-as-01"
        name                = "iw-p-itn-apps-apim-as-01"
        tags                = {}
        # (4 unchanged attributes hidden)

      ~ profile {
            name = "default"

          ~ capacity {
              ~ maximum = 2 -> 6
                # (2 unchanged attributes hidden)
            }

          ~ rule {
              ~ metric_trigger {
                  ~ time_window              = "PT10M" -> "PT3M"
                    # (9 unchanged attributes hidden)
                }
              ~ scale_action {
                  ~ cooldown  = "PT45M" -> "PT5M"
                    # (3 unchanged attributes hidden)
                }
            }
          ~ rule {
              ~ metric_trigger {
                  ~ time_window              = "PT30M" -> "PT5M"
                    # (9 unchanged attributes hidden)
                }
              ~ scale_action {
                  ~ cooldown  = "PT30M" -> "PT5M"
                    # (3 unchanged attributes hidden)
                }
            }
        }
    }

  # module.cdn.azurerm_cdn_frontdoor_route.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "this" {
        id                              = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Cdn/profiles/iw-p-itn-cdn-afd-01/afdEndpoints/iw-p-itn-cdn-fde-01/routes/iw-p-itn-cdn-cdnr-01"
        name                            = "iw-p-itn-cdn-cdnr-01"
        # (12 unchanged attributes hidden)

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "IgnoreQueryString"
        }
    }

  # module.function_apps.azurerm_monitor_metric_alert.app_service_plan_cpu_alert will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "app_service_plan_cpu_alert" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-user-asp-01] High CPU Usage"
        name                     = "[iw-p-itn-user-asp-01] High CPU Usage"
        tags                     = {}
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.azurerm_monitor_metric_alert.function_app_support_response_time will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_support_response_time" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-support-func-01] Slow Response Time"
        name                     = "[iw-p-itn-support-func-01] Slow Response Time"
        tags                     = {
            "BusinessUnit" = "IT-Wallet"
            "CostCenter"   = "TS000 - Tecnologia e Servizi"
            "CreatedBy"    = "Terraform"
            "Environment"  = "PROD"
            "Source"       = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.function_apps.azurerm_monitor_metric_alert.function_app_user_response_time will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_user_response_time" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-user-func-01] Slow Response Time"
        name                     = "[iw-p-itn-user-func-01] Slow Response Time"
        tags                     = {
            "BusinessUnit" = "IT-Wallet"
            "CostCenter"   = "TS000 - Tecnologia e Servizi"
            "CreatedBy"    = "Terraform"
            "Environment"  = "PROD"
            "Source"       = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_accounts.azurerm_key_vault_secret.st_connection_string[0] will be created
  + resource "azurerm_key_vault_secret" "st_connection_string" {
      + content_type            = "connection string"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + name                    = "StorageConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage_accounts.azurerm_key_vault_secret.st_uat_connection_string[0] will be created
  + resource "azurerm_key_vault_secret" "st_uat_connection_string" {
      + content_type            = "connection string"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + name                    = "StorageUatConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage_accounts.azurerm_storage_account.common will be updated in-place
  ~ resource "azurerm_storage_account" "common" {
        id                                 = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iwpitnappsst01"
        name                               = "iwpitnappsst01"
      ~ shared_access_key_enabled          = true -> false
        tags                               = {
            "BusinessUnit" = "IT-Wallet"
            "CostCenter"   = "TS000 - Tecnologia e Servizi"
            "CreatedBy"    = "Terraform"
            "Environment"  = "PROD"
            "Source"       = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (96 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/iw-p-itn-user-func-01"
        name                                           = "iw-p-itn-user-func-01"
        tags                                           = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (34 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsWebHost__hostid",
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.generateEntityConfiguration.Disabled",
              - "AzureWebJobs.migrateWalletInstances.Disabled",
                "AzureWebJobs.sendEmailOnWalletInstanceCreation.Disabled",
                "AzureWebJobs.sendEmailOnWalletInstanceRevocation.Disabled",
              - "SLOT_TASK_HUBNAME",
              - "AzureFunctionsJobHost__extensions__durableTask__hubName",
              - "AzureFunctionsWebHost__hostid",
              + "AzureWebJobs.migrateWalletInstances.Disabled",
            ]
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "FrontDoorEndpointName"                                                                            = "iw-p-itn-cdn-fde-01" -> "iw-p-itn-cdn-fde-01-aza7ezdzg9buc8gm.a02.azurefd.net"
            # (78 unchanged elements hidden)
        }
        id                                             = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/iw-p-itn-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-user-func-01] Health Check Failed"
        name                     = "[iw-p-itn-user-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iwpitnuserstfn01] Low Availability"
        name                     = "[iwpitnuserstfn01] Low Availability"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "StorageConnectionString"                                                                          = "@Microsoft.KeyVault(VaultName=iw-p-itn-apps-kv-01;SecretName=StorageUatConnectionString)"
            # (79 unchanged elements hidden)
        }
        id                                             = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/iw-u-itn-user-func-01"
        name                                           = "iw-u-itn-user-func-01"
        tags                                           = {
            "BusinessUnit"                           = "IT-Wallet"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "PROD"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "4.1.1"
            "Source"                                 = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "StorageConnectionString"                                                                          = "@Microsoft.KeyVault(VaultName=iw-p-itn-apps-kv-01;SecretName=StorageUatConnectionString)"
            # (79 unchanged elements hidden)
        }
        id                                             = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/iw-u-itn-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "IT-Wallet"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "PROD"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "4.1.1"
            "Source"                                 = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-u-itn-user-func-01] Health Check Failed"
        name                     = "[iw-u-itn-user-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iwuitnuserstfn01] Low Availability"
        name                     = "[iwuitnuserstfn01] Low Availability"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 23 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim.azurerm_api_management.this,
  on .terraform/modules/apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 6 more similar warnings elsewhere)
```

</details>
